# Тема 3. Базовые операции языка Python
Отчет по Теме #3 выполнил(а):
- Обласова Александра Владимировна
- ИВТ-22-2

| Задание | Лаб_раб | Сам_раб |
| ------ | ------ | ------ |
| Задание 1 | + | - |
| Задание 2 | - | - |
| Задание 3 | - | - |
| Задание 4 | - | - |
| Задание 5 | - | - |
| Задание 6 | - | - |
| Задание 7 | - | - |
| Задание 8 | - | - |
| Задание 9 | - | - |
| Задание 10 | - | - |

знак "+" - задание выполнено; знак "-" - задание не выполнено;

Работу проверили:
- к.э.н., доцент Панов М.А.

## Лабораторная работа №1
### Создайте две переменные, значение которых будете вводить через консоль. Также составьте условие, в котором созданные ранее переменные будут сравниваться, если условие выполняется, то выведете в консоль «Выполняется», если нет, то «Не выполняется».

```python
a = input("Введите значение первой переменной: ")
b = input("Введите значение второй переменной: ")

if a >= b:
  print("Выполняется")
else:
  print("Не выполняется")
```

### Результат.


## Вывод


## Лабораторная работа №2
### Напишите программу, которая будет определять значения переменной меньше 0, больше 0 и меньше 10 или больше 10. Это нужно реализовать при помощи одной переменной, значение которой будет вводится через консоль, а также при помощи конструкций if, elif, else.

```python
number = int(input("Введите значение переменной: "))

if number < 0:
  print("Переменная меньше 0")
elif number > 0 and number < 10:
  print("Переменная больше 0 и меньше 10")
else:
  print("Переменная больше 10")
```

### Результат.


## Вывод

## Лабораторная работа №3
### Напишите программу, в которой будет проверяться есть ли переменная в указанном массиве используя логический оператор in. Самостоятельно посмотрите, как работает программа со значениями которых нет в массиве numbers.

```python
numbers = [1, 2, 3, 4, 5]

number = int(input("Введите значение переменной: "))

if number in numbers:
  print(f"Переменная {number} есть в массиве")
else:
  print(f"Переменной {number} нет в массиве")
```

### Результат.

## Вывод
  
## Лабораторная работа №4
### Напишите программу, которая будет определять находится ли переменная в указанном массиве и если да, то проверьте четная она или нет. Самостоятельно протестируйте данную программу с разными значениями переменной value.

```python
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

value = int(input("Введите значение переменной: "))

if value in numbers:
  print(f"Переменная {value} есть в массиве")
  if value % 2 == 0:
    print(f"Переменная {value} четная")
  else:
    print(f"Переменная {value} нечетная")
else:
  print(f"Переменной {value} нет в массиве")
```

### Результат.


## Вывод

## Лабораторная работа №5
### Напишите программу, в которой циклом for значения переменной i будут меняться от 0 до 10 и посмотрите, как разные виды сравнений и операций работают в цикле.

```python
for i in range(10):
    print(f"i = {i}")

    if i == 0:
        i += 2
    if i == 1:
        continue
    if i == 2 or i == 3:
        print('Переменная равна 2 или 3')

    elif i in [4, 5, 6]:
        print('Переменная равна 4,5 или 6')
    else:
        break
```

### Результат.

## Вывод

## Лабораторная работа №
### Напишите программу, в которой при помощи цикла for определяется есть ли переменная value в строке string и посмотрите, как работает оператор else для циклов. Самостоятельно посмотрите, что выведет программа, если значение переменной value оказалось в строке string. 
### Определять индекс буквы не обязательно, но если вы хотите, то это делается при помощи строки: 
```python
index = string.find(value)
```
### Вы берете название переменной, в которой вы хотите что-то найти, затем применяете встроенный метод find() и в нем указываете то, что вам нужно найти. Данная строка вернет индекс искомого объекта.


```python
string = "Привет, мир!"
value = input()

found = False

for i in string:
  if i == value:
    found = True
    print(f"Символ '{value}' найден в строке")
    # index = string.find(value)
    # print(f"Индекс символа: {index}")
    break

else:
  print(f"Символа '{value}' нет в строке")
```

### Результат.


## Вывод

## Лабораторная работа №7
- Текст задания

```python

```

### Результат.


## Вывод

## Лабораторная работа №8
- Текст задания

```python

```

### Результат.


## Вывод

## Лабораторная работа №9
- Текст задания

```python

```

### Результат.


## Вывод

## Лабораторная работа №10
- Текст задания

```python

```

### Результат.


## Вывод

## Самостоятельная работа №1
- Текст задания
- Оформленный код
- Скрины консоли
- Развернутый вывод
  
## Самостоятельная работа №2
- Текст задания
- Оформленный код
- Скрины консоли
- Развернутый вывод
  
## Самостоятельная работа №3
- Текст задания
- Оформленный код
- Скрины консоли
- Развернутый вывод
  
## Самостоятельная работа №4
- Текст задания
- Оформленный код
- Скрины консоли
- Развернутый вывод
  
## Самостоятельная работа №5
- Текст задания
- Оформленный код
- Скрины консоли
- Развернутый вывод
  
## Самостоятельная работа №6
- Текст задания
- Оформленный код
- Скрины консоли
- Развернутый вывод
  
## Самостоятельная работа №7
- Текст задания
- Оформленный код
- Скрины консоли
- Развернутый вывод
  
## Самостоятельная работа №8
- Текст задания
- Оформленный код
- Скрины консоли
- Развернутый вывод
  
## Самостоятельная работа №9
- Текст задания
- Оформленный код
- Скрины консоли
- Развернутый вывод
  
## Самостоятельная работа №10
- Текст задания
- Оформленный код
- Скрины консоли
- Развернутый вывод

## Общие выводы по теме
- Развернутый вывод
